TransportManagementDevelop_KAT/Конфигурация/src/Catalogs/гкс_РесурсыВебСервисов/гкс_РесурсыВебСервисов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>гкс_РесурсыВебСервисов</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>Warehouse_API</name>
      <description>Warehouse API</description>
      </content>
      </content>
      </content>
      </content>
      </content>
      </content>
      </content>
      </content>
    </items>
    <items>
      <name>ДанныеMFM</name>
      <description>Данные MFM</description>
    </items>
  </predefined>
  <attributes>
    <name>Подключение</name>
    <type>
      <types>CatalogRef.гкс_ПодключениеКВебСервисам</types>
    </type>
  </attributes>
  <attributes>
    <name>URL</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаНаДокументацию</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Метод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Логировать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Заголовки</name>
    <attributes>
      <name>Заголовок</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Параметры</name>
    <attributes>
      <name>ИмяПараметра</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипПараметра</name>
      <type>
        <types>EnumRef.гкс_ТипПараметраЗапроса</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

TransportManagementDevelop_KAT/Конфигурация/src/Enums/гкс_ТипПараметраЗапроса/гкс_ТипПараметраЗапроса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гкс_ТипПараметраЗапроса</name>
  <enumValues>
    <name>path</name>
  </enumValues>
  <enumValues>
    <name>query</name>
  </enumValues>
</mdclass:Enum>

TransportManagementDevelop_KAT/Конфигурация/src/Catalogs/гкс_ПодключениеКВебСервисам/гкс_ПодключениеКВебСервисам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>гкс_ПодключениеКВебСервисам</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ПодключениеWarehouse</name>
      <description>Подключение Warehouse</description>
    </items>
    <items>
      <name>ПодключениеСРПВ</name>
      <description>Подключение СРПВ</description>
    </items>
  </predefined>
  <attributes>
    <name>Сервер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Порт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Таймаут</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьЗащищенноеСоединение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьАутентификациюОС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПрокси</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроксиСервер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроксиПорт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТехнологияОбмена</name>
    <type>
      <types>EnumRef.гкс_ТехнологииОбменаДанными</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресWSDL</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>URIПространстваИмен</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяСервиса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяТочкиПодключения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

TransportManagementDevelop_KAT/Конфигурация/src/Catalogs/гкс_РесурсыВебСервисов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Полный адрес
// 
// Параметры:
//  Ресурс - СправочникСсылка.гкс_РесурсыВебСервисов - Сервис
//  ЗначенияПараметров - Структура - Значение параметров для заполнения
//
// Возвращаемое значение:
//  Строка - полный адрес ресурса, включая родительские адреса
//
Функция ПолныйАдрес(Ресурс, ЗначенияПараметров = Неопределено) Экспорт
	
	УРЛРесурса = "";

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ресурс);
	Запрос.Текст =  
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|   Сервисы.Родитель КАК КорневойУзел,
		|	ЕстьNull(Сервисы.Родитель.URL, """") КАК РодительURL,
		|	Сервисы.URL КАК URL
		|ИЗ
		|	Справочник.гкс_РесурсыВебСервисов КАК Сервисы
		|ГДЕ
		|	Сервисы.Ссылка = &Ссылка";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Пока Не РезультатЗапроса.Пустой() Цикл
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		УРЛРесурса = СтрШаблон("/%1%2", Выборка.URL, УРЛРесурса);
		
		Запрос.УстановитьПараметр("Ссылка", Выборка.КорневойУзел);
		РезультатЗапроса = Запрос.Выполнить();	
			
	КонецЦикла;
	
	// заполнение параметров в пути
	Если ЗначениеЗаполнено(ЗначенияПараметров) Тогда
        УРЛРесурса = ДополнитьАдреснуюСтрокуПараметрами(Ресурс, УРЛРесурса, ЗначенияПараметров);
	КонецЕсли;	
	
	Подключение = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ресурс, "Подключение");
	Если Не ЗначениеЗаполнено(Подключение) Тогда
		ВызватьИсключение НСтр("ru='Не заполнено подключение. Вызов невозможен'");
	КонецЕсли;
	
	Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Подключение, "Сервер,Порт,ИспользоватьЗащищенноеСоединение,");
	
	Схема = "http";
	Если Реквизиты.ИспользоватьЗащищенноеСоединение Тогда
		Схема = "https";
	КонецЕсли;
	
	Результат = СтрШаблон("%1://%2:%3%4", Схема, Реквизиты.Сервер, Реквизиты.Порт, УРЛРесурса);
	
	Возврат Результат;
	
КонецФункции
	
// Подключение к сервису.
// 
// Параметры:
//  Сервис - СправочникСсылка.гкс_РесурсыВебСервисов - Сервис
// 
// Возвращаемое значение:
//  СправочникСсылка.гкс_ПодключениеКВебСервисам - Подключение к сервису
//
Функция ПодключениеКСервису(Ресурс) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ресурс);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ВсеСервисы.Подключение КАК Подключение
	|ИЗ
	|	Справочник.гкс_РесурсыВебСервисов КАК ВсеСервисы
	|ГДЕ
	|	ВсеСервисы.Ссылка = &Ссылка";
	
	РезультатЗапроса = Запрос.Выполнить();

	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Результат = Выборка.Подключение;
	Иначе
		Результат = Справочники.гкс_ПодключениеКВебСервисам.ПустаяСсылка();
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает ссылку на предопределенный элемент справочника ресурсов веб-сервисов по имени предопределенных данных.
//
// Параметры:
//   ИмяПредопределенного - Строка - Имя предопределенных данных
//
// Возвращаемое значение:
//   СправочникСсылка.гкс_РесурсыВебСервисов - Ссылка на предопределенный элемент
//   Неопределено - Элемент не найден
//
Функция ОписаниеПоИмениПредопределенного(ИмяПредопределенного) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	РесурсыВебСервисов.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.гкс_РесурсыВебСервисов КАК РесурсыВебСервисов
		|ГДЕ
		|	РесурсыВебСервисов.ИмяПредопределенныхДанных = &ИмяПредопределенныхДанных";
	
	Запрос.УстановитьПараметр("ИмяПредопределенныхДанных", ИмяПредопределенного);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий(); 
		Результат = ВыборкаДетальныеЗаписи.Ссылка;
	Иначе
		Результат = Неопределено;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
	
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	

КонецПроцедуры	

// Определяет настройки начального заполнения элементов
//
// Параметры:
//  Настройки - Структура - настройки заполнения:
//   * ПриНачальномЗаполненииЭлемента - Булево - Если Истина, то для каждого элемента будет
//      вызвана процедура индивидуального заполнения ПриНачальномЗаполненииЭлемента.
//
Процедура ПриНастройкеНачальногоЗаполненияЭлементов(Настройки) Экспорт
	
	Настройки.ПриНачальномЗаполненииЭлемента = Ложь;
	
КонецПроцедуры

// Вызывается при начальном заполнении справочника.
//
// Параметры:
//  КодыЯзыков - Массив - список языков конфигурации. Актуально для мультиязычных конфигураций.
//  Элементы   - ТаблицаЗначений - данные заполнения. Состав колонок соответствует набору реквизитов
//                                 справочника.
//  ТабличныеЧасти - Структура - Ключ - Имя табличной части объекта.
//                               Значение - Выгрузка в таблицу значений пустой табличной части.
//
Процедура ПриНачальномЗаполненииЭлементов(КодыЯзыков, Элементы, ТабличныеЧасти) Экспорт
	
	#Область Warehouse
	
	ПутьКSwagger = "https://warehouse.sodru.com/swagger/ui/index";
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "Warehouse_API";
	Элемент.Наименование = НСтр("ru = 'Warehouse API'", ОбщегоНазначения.КодОсновногоЯзыка());
	Элемент.URL = "api";
	Элемент.СсылкаНаДокументацию = ПутьКSwagger;
	Элемент.Подключение = Справочники.гкс_ПодключениеКВебСервисам.ПодключениеWarehouse;
	
	Описание_ExternalSamples(Элементы, ПутьКSwagger);
	Описание_ExternalSampleType(Элементы, ПутьКSwagger);
	Описание_Goods(Элементы, ПутьКSwagger);
	Описание_QualityIndicatorCodes(Элементы, ПутьКSwagger);
	Описание_QualityIndicators(Элементы, ПутьКSwagger);
    Описание_Units(Элементы, ПутьКSwagger);
	Описание_Stations(Элементы, ПутьКSwagger);
		
	#КонецОбласти
		
КонецПроцедуры

//// Вызывается при начальном заполнении создаваемого элемента.
////
//// Параметры:
////  Объект                  - СправочникОбъект.гкс_РесурсыВебСервисов - заполняемый объект.
////  Данные                  - СтрокаТаблицыЗначений - данные заполнения.
////  ДополнительныеПараметры - Структура - Дополнительные параметры.
////
//Процедура ПриНачальномЗаполненииЭлемента(Объект, Данные, ДополнительныеПараметры) Экспорт
//		
//КонецПроцедуры

#Область ОбновлениеИнформационнойБазы

// Добавляет в список процедуры-обработчики обновления данных ИБ
// для всех поддерживаемых версий библиотеки или конфигурации.
// Вызывается перед началом обновления данных ИБ для построения плана обновления.
//
// Параметры:
//  Обработчики - см. ОбновлениеИнформационнойБазы.НоваяТаблицаОбработчиковОбновления
//
// Пример:
//  Для добавления своей процедуры-обработчика в список:
//  Обработчик = Обработчики.Добавить();
//  Обработчик.Версия              = "1.1.0.0";
//  Обработчик.Процедура           = "ОбновлениеИБ.ПерейтиНаВерсию_1_1_0_0";
//  Обработчик.РежимВыполнения     = "Оперативно";
//
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт

	Обработчик = Обработчики.Добавить();
	Обработчик.Процедура = "Справочники.гкс_РесурсыВебСервисов.ЗаполнитьЭлементыНачальнымиДанными";
	Обработчик.Версия = "*";
	Обработчик.РежимВыполнения = "Оперативно"; // Оперативно
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("11c1e1ef-ead8-4587-bb84-8bb9e46d5572");
	Обработчик.ПроцедураЗаполненияДанныхОбновления = 
			"Справочники.гкс_РесурсыВебСервисов.ЗарегистрироватьПредопределенныеЭлементыДляОбновления";
	
	Обработчик.ПроцедураПроверки = "ОбновлениеИнформационнойБазы.ДанныеОбновленыНаНовуюВерсиюПрограммы";
	
	Обработчик.Комментарий = НСтр("ru = 'Обновление наименований предопределенных элементов.
	|До завершения обработки наименования этих элементов в ряде случаев будет отображаться некорректно.'");
	
	Читаемые = Новый Массив;
	Читаемые.Добавить(Метаданные.Справочники.гкс_РесурсыВебСервисов.ПолноеИмя());
	Обработчик.ЧитаемыеОбъекты = СтрСоединить(Читаемые, ",");
	
	Изменяемые = Новый Массив;
	Изменяемые.Добавить(Метаданные.Справочники.гкс_РесурсыВебСервисов.ПолноеИмя());
	Обработчик.ИзменяемыеОбъекты = СтрСоединить(Изменяемые, ",");
	
	Блокируемые = Новый Массив;
	Блокируемые.Добавить(Метаданные.Справочники.гкс_РесурсыВебСервисов.ПолноеИмя());
	Обработчик.БлокируемыеОбъекты = СтрСоединить(Блокируемые, ",");

КонецПроцедуры

Процедура ЗарегистрироватьПредопределенныеЭлементыДляОбновления(Параметры) Экспорт
	
	ОбновлениеИнформационнойБазы.ЗарегистрироватьПредопределенныеЭлементыДляОбновления(
								Параметры, Метаданные.Справочники.гкс_РесурсыВебСервисов);
	
КонецПроцедуры

Процедура ЗаполнитьЭлементыНачальнымиДанными(Параметры) Экспорт
	
	НастройкиЗаполнения = ОбновлениеИнформационнойБазы.НастройкиЗаполнения();
	НастройкиЗаполнения.Реквизиты = "Наименование, URL, СсылкаНаДокументацию, Метод, Логировать, Подключение";
	
	ОбновлениеИнформационнойБазы.ЗаполнитьЭлементыНачальнымиДанными(Параметры, 
			Метаданные.Справочники.гкс_РесурсыВебСервисов, НастройкиЗаполнения);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДополнитьАдреснуюСтрокуПараметрами(Ресурс, УРЛРесурса, ЗначенияПараметров)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РесурсыВебСервисовПараметры.ИмяПараметра КАК ИмяПараметра
		|ИЗ
		|	Справочник.гкс_РесурсыВебСервисов.Параметры КАК РесурсыВебСервисовПараметры
		|ГДЕ
		|	РесурсыВебСервисовПараметры.Ссылка = &Ссылка
		|	И РесурсыВебСервисовПараметры.ТипПараметра = ЗНАЧЕНИЕ(Перечисление.гкс_ТипПараметраЗапроса.path)";
	
	Запрос.УстановитьПараметр("Ссылка", Ресурс);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ЗначениеПараметра = Неопределено;
		ЗначенияПараметров.Свойство(ВыборкаДетальныеЗаписи.ИмяПараметра, ЗначениеПараметра);
		
		Если ЗначенияПараметров <> Неопределено Тогда
			СтрокаПоиска = СтрШаблон("{%1}", ВыборкаДетальныеЗаписи.ИмяПараметра);
			УРЛРесурса = СтрЗаменить(УРЛРесурса, СтрокаПоиска, Строка(ЗначениеПараметра));
		КонецЕсли;
	КонецЦикла;
	
	Возврат УРЛРесурса;
	
КонецФункции

// Метод.
// 
// Параметры:
//  Сервис - СправочникСсылка.гкс_РесурсыВебСервисов - 
// 
// Возвращаемое значение:
//  Строка - 
Функция Метод(Сервис) Экспорт
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Сервис, "Метод");
КонецФункции

Функция ЗаголовкиКакСоотвествие(Сервис) Экспорт
	
	Результат = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Сервис);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Заголовки.Заголовок КАК Заголовок,
	|	Заголовки.Значение КАК Значение
	|ИЗ
	|	Справочник.гкс_РесурсыВебСервисов.Заголовки КАК Заголовки
	|ГДЕ
	|	Заголовки.Ссылка = &Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(Выборка.Заголовок, Выборка.Значение);	
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Процедура Описание_ExternalSamples(Элементы, ПутьКSwagger)
	
	ИмяГруппыОпераций = "ExternalSamples";
	
	#Область ExternalSamples
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ExternalSamples";
	Элемент.Наименование = НСтр("ru = 'Внешние пробы'", 
								ОбщегоНазначения.КодОсновногоЯзыка());

	Элемент.СсылкаНаДокументацию = СтрШаблон("%1#!/%2", ПутьКSwagger, ИмяГруппыОпераций);
	Элемент.Метод = "GET";
	Элемент.Логировать = Истина;
	Элемент.Подключение = Справочники.гкс_ПодключениеКВебСервисам.ПодключениеWarehouse;	
	#КонецОбласти
		
	#Область ExternalSamples_GetBetweenUpdDatesFilteredByClientIdOrStation
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ExternalSamples_GetBetweenUpdDatesFilteredByClientIdOrStation";
	Элемент.Наименование = НСтр("ru = 'Внешние пробы по дате изменения, клиенту или станции назначения'", 
								ОбщегоНазначения.КодОсновногоЯзыка());
	Элемент.URL = "{language}/ExternalSamples/GetBetweenUpdDatesFilteredByClientIdOrStation";
	Элемент.СсылкаНаДокументацию = СтрШаблон("%1#!/%2/%3", 
								ПутьКSwagger, ИмяГруппыОпераций, Элемент.ИмяПредопределенныхДанных);
	Элемент.Метод = "GET";
	Элемент.Логировать = Истина;
	Элемент.Подключение = Справочники.гкс_ПодключениеКВебСервисам.ПодключениеWarehouse;	
	#КонецОбласти
	
	#Область ExternalSamples_GetBetweenDatesFilteredByStation
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ExternalSamples_GetBetweenDatesFilteredByStation";
	Элемент.Наименование = НСтр("ru = 'Внешние пробы по датам с учетом станции'", 
								ОбщегоНазначения.КодОсновногоЯзыка());
	Элемент.URL = "{language}/ExternalSamples/GetBetweenDatesFilteredByStation";
	Элемент.СсылкаНаДокументацию = СтрШаблон("%1#!/%2/%3", 
								ПутьКSwagger, ИмяГруппыОпераций, Элемент.ИмяПредопределенныхДанных);
	Элемент.Метод = "GET";
	Элемент.Логировать = Истина;
	Элемент.Подключение = Справочники.гкс_ПодключениеКВебСервисам.ПодключениеWarehouse;	
	#КонецОбласти
	
	#Область ExternalSamples_GetBetweenDatesFilteredByGoodType
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ExternalSamples_GetBetweenDatesFilteredByGoodType";
	Элемент.Наименование = НСтр("ru = 'Внешние пробы с фильтром по виду продукта'", 
								ОбщегоНазначения.КодОсновногоЯзыка());
	Элемент.URL = "{language}/ExternalSamples/GetBetweenDatesFilteredByGoodType";
	Элемент.СсылкаНаДокументацию = СтрШаблон("%1#!/%2/%3", 
								ПутьКSwagger, ИмяГруппыОпераций, Элемент.ИмяПредопределенныхДанных);
	Элемент.Метод = "GET";
	Элемент.Логировать = Истина;
	Элемент.Подключение = Справочники.гкс_ПодключениеКВебСервисам.ПодключениеWarehouse;	
	#КонецОбласти
	
	#Область ExternalSamples_GetByReceiptId
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ExternalSamples_GetByReceiptId";
	Элемент.Наименование = НСтр("ru = 'Внешние пробы по идентификатору поступления'", 
								ОбщегоНазначения.КодОсновногоЯзыка());
	Элемент.URL = "ExternalSamples/GetByReceiptId/{receiptId}";
	Элемент.СсылкаНаДокументацию = СтрШаблон("%1#!/%2/%3", 
								ПутьКSwagger, ИмяГруппыОпераций, Элемент.ИмяПредопределенныхДанных);
	Элемент.Метод = "GET";
	Элемент.Логировать = Истина;
	Элемент.Подключение = Справочники.гкс_ПодключениеКВебСервисам.ПодключениеWarehouse;	
	#КонецОбласти

	#Область ExternalSamples_GetByGroupId
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ExternalSamples_GetByGroupId";
	Элемент.Наименование = НСтр("ru = 'Внешние пробы по идентификатору группы'", 
								ОбщегоНазначения.КодОсновногоЯзыка());
	Элемент.URL = "ExternalSamples/GetByGroupId/{groupId}";
	Элемент.СсылкаНаДокументацию = СтрШаблон("%1#!/%2/%3", 
								ПутьКSwagger, ИмяГруппыОпераций, Элемент.ИмяПредопределенныхДанных);
	Элемент.Метод = "GET";
	Элемент.Логировать = Истина;
	Элемент.Подключение = Справочники.гкс_ПодключениеКВебСервисам.ПодключениеWarehouse;	
	#КонецОбласти
	
	#Область ExternalSamples_GetById
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ExternalSamples_GetById";
	Элемент.Наименование = НСтр("ru = 'Внешняя проба по идентификатору'", 
								ОбщегоНазначения.КодОсновногоЯзыка());
	Элемент.URL = "ExternalSamples/{id}";
	Элемент.СсылкаНаДокументацию = СтрШаблон("%1#!/%2/%3", 
								ПутьКSwagger, ИмяГруппыОпераций, Элемент.ИмяПредопределенныхДанных);
	Элемент.Метод = "GET";
	Элемент.Логировать = Истина;
	Элемент.Подключение = Справочники.гкс_ПодключениеКВебСервисам.ПодключениеWarehouse;	
	#КонецОбласти
	
	ИмяГруппыОпераций = "";
	#Область ExternalSamples_GetBetweenDates
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ExternalSamples_GetBetweenDates";
	Элемент.Наименование = НСтр("ru = 'Внешние пробы по периоду'", 
								ОбщегоНазначения.КодОсновногоЯзыка());
	Элемент.URL = "ru/ExternalSamples/GetBetweenDates";	
	Элемент.СсылкаНаДокументацию = СтрШаблон("%1#!/%2/%3", 
								ПутьКSwagger, ИмяГруппыОпераций, Элемент.ИмяПредопределенныхДанных);
	Элемент.Метод = "GET";
	Элемент.Логировать = Истина;
	Элемент.Подключение = Справочники.гкс_ПодключениеКВебСервисам.ПодключениеWarehouse;	
	#КонецОбласти
	
	#Область ExternalSamples_GetBetweenUpdatedOnDates
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ExternalSamples_GetBetweenUpdatedOnDates";
	Элемент.Наименование = НСтр("ru = 'Внешние пробы измененные за период'", 
								ОбщегоНазначения.КодОсновногоЯзыка());
	Элемент.URL = "ru/ExternalSamples/GetBetweenUpdatedOnDates";	
	Элемент.СсылкаНаДокументацию = СтрШаблон("%1#!/%2/%3", 
								ПутьКSwagger, ИмяГруппыОпераций, Элемент.ИмяПредопределенныхДанных);
	Элемент.Метод = "GET";
	Элемент.Логировать = Истина;
	Элемент.Подключение = Справочники.гкс_ПодключениеКВебСервисам.ПодключениеWarehouse;	
	#КонецОбласти
	
КонецПроцедуры

Процедура Описание_ExternalSampleType(Элементы, ПутьКSwagger)
	
	ИмяГруппыОпераций = "ExternalSampleType";
	
	#Область ExternalSampleType
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ExternalSampleType";
	Элемент.Наименование = НСтр("ru = 'Типы внешних проб'", 
								ОбщегоНазначения.КодОсновногоЯзыка());
	Элемент.URL = ИмяГруппыОпераций;
	Элемент.СсылкаНаДокументацию = СтрШаблон("%1#!/%2", ПутьКSwagger, ИмяГруппыОпераций);
	Элемент.Метод = "GET";
	Элемент.Логировать = Истина;
	Элемент.Подключение = Справочники.гкс_ПодключениеКВебСервисам.ПодключениеWarehouse;	
	#КонецОбласти
	
	#Область ExternalSampleType_GetById
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ExternalSampleType_GetById";
	Элемент.Наименование = НСтр("ru = 'Тип внешней пробы по идентификатору'", 
								ОбщегоНазначения.КодОсновногоЯзыка());
	Элемент.URL = "{id}";
	Элемент.СсылкаНаДокументацию = СтрШаблон("%1#!/%2/%3", 
								ПутьКSwagger, ИмяГруппыОпераций, Элемент.ИмяПредопределенныхДанных);
	Элемент.Метод = "GET";
	Элемент.Логировать = Истина;
	Элемент.Подключение = Справочники.гкс_ПодключениеКВебСервисам.ПодключениеWarehouse;	
	#КонецОбласти
	
КонецПроцедуры

Процедура Описание_Goods(Элементы, ПутьКSwagger)
	
	ИмяГруппыОпераций = "Goods";
	
	#Область Goods
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "Goods";
	Элемент.Наименование = НСтр("ru = 'Продукция'", 
								ОбщегоНазначения.КодОсновногоЯзыка());
	Элемент.URL = ИмяГруппыОпераций;
	Элемент.СсылкаНаДокументацию = СтрШаблон("%1#!/%2", ПутьКSwagger, ИмяГруппыОпераций);
	Элемент.Метод = "GET";
	Элемент.Логировать = Истина;
	Элемент.Подключение = Справочники.гкс_ПодключениеКВебСервисам.ПодключениеWarehouse;	
	#КонецОбласти

	#Область Goods_GetById
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "Goods_GetById";
	Элемент.Наименование = НСтр("ru = 'Продукт по идентификатору'", 
								ОбщегоНазначения.КодОсновногоЯзыка());
	Элемент.URL = "{id}";
	Элемент.СсылкаНаДокументацию = СтрШаблон("%1#!/%2/%3", 
								ПутьКSwagger, ИмяГруппыОпераций, Элемент.ИмяПредопределенныхДанных);
	Элемент.Метод = "GET";
	Элемент.Логировать = Истина;
	Элемент.Подключение = Справочники.гкс_ПодключениеКВебСервисам.ПодключениеWarehouse;	
	#КонецОбласти	

КонецПроцедуры

Процедура Описание_QualityIndicatorCodes(Элементы, ПутьКSwagger)
	
	ИмяГруппыОпераций = "QualityIndicatorCodes";
	
	#Область QualityIndicatorCodes
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "QualityIndicatorCodes";
	Элемент.Наименование = НСтр("ru = 'Маппинг показателей качества (с внешними)'", 
								ОбщегоНазначения.КодОсновногоЯзыка());
	Элемент.URL = ИмяГруппыОпераций;
	Элемент.СсылкаНаДокументацию = СтрШаблон("%1#!/%2", ПутьКSwagger, ИмяГруппыОпераций);
	Элемент.Метод = "GET";
	Элемент.Логировать = Истина;
	Элемент.Подключение = Справочники.гкс_ПодключениеКВебСервисам.ПодключениеWarehouse;	
	#КонецОбласти
	
	#Область QualityIndicatorCodes_GetById
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "QualityIndicatorCodes_GetById";
	Элемент.Наименование = НСтр("ru = 'Маппинг показателея по идентификатору'", 
								ОбщегоНазначения.КодОсновногоЯзыка());
	Элемент.URL = "{id}";
	Элемент.СсылкаНаДокументацию = СтрШаблон("%1#!/%2/%3", 
								ПутьКSwagger, ИмяГруппыОпераций, Элемент.ИмяПредопределенныхДанных);
	Элемент.Метод = "GET";
	Элемент.Логировать = Истина;
	Элемент.Подключение = Справочники.гкс_ПодключениеКВебСервисам.ПодключениеWarehouse;	
	#КонецОбласти

КонецПроцедуры

Процедура Описание_QualityIndicators(Элементы, ПутьКSwagger)
	
	ИмяГруппыОпераций = "QualityIndicators";
	
	#Область QualityIndicators
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "QualityIndicators";
	Элемент.Наименование = НСтр("ru = 'Качественные показатели'", ОбщегоНазначения.КодОсновногоЯзыка());
	Элемент.URL = СтрШаблон("%1%2", ИмяГруппыОпераций, "?withDeleted=true");
	Элемент.СсылкаНаДокументацию = СтрШаблон("%1#!/%2", ПутьКSwagger, ИмяГруппыОпераций);
	Элемент.Метод = "GET";
	Элемент.Логировать = Истина;
	Элемент.Подключение = Справочники.гкс_ПодключениеКВебСервисам.ПодключениеWarehouse;	
	#КонецОбласти
	
	#Область QualityIndicators_GetUsed
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "QualityIndicators_GetUsed";
	Элемент.Наименование = НСтр("ru = 'Качественные показатели используемые диспетчером'", 
								ОбщегоНазначения.КодОсновногоЯзыка());
	Элемент.URL = "GetUsed";
	Элемент.СсылкаНаДокументацию = СтрШаблон("%1#!/%2/%3", 
								ПутьКSwagger, ИмяГруппыОпераций, Элемент.ИмяПредопределенныхДанных);
	Элемент.Метод = "GET";
	Элемент.Логировать = Истина;
	Элемент.Подключение = Справочники.гкс_ПодключениеКВебСервисам.ПодключениеWarehouse;	
	#КонецОбласти
	
	#Область QualityIndicators_GetUsedByQs
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "QualityIndicators_GetUsedByQs";
	Элемент.Наименование = НСтр("ru = 'Качественные показатели используемые специалистом по качеству'", 
								ОбщегоНазначения.КодОсновногоЯзыка());
	Элемент.URL = "GetUsedByQS";
	Элемент.СсылкаНаДокументацию = СтрШаблон("%1#!/%2/%3", 
								ПутьКSwagger, ИмяГруппыОпераций, Элемент.ИмяПредопределенныхДанных);
	Элемент.Метод = "GET";
	Элемент.Логировать = Истина;
	Элемент.Подключение = Справочники.гкс_ПодключениеКВебСервисам.ПодключениеWarehouse;	
	#КонецОбласти
	
	#Область QualityIndicators_GetById
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "QualityIndicators_GetById";
	Элемент.Наименование = НСтр("ru = 'Качественный показатель по идентификатору'", 
								ОбщегоНазначения.КодОсновногоЯзыка());
	Элемент.URL = "{id}?withDeleted=true";
	Элемент.СсылкаНаДокументацию = СтрШаблон("%1#!/%2/%3", 
								ПутьКSwagger, ИмяГруппыОпераций, Элемент.ИмяПредопределенныхДанных);
	Элемент.Метод = "GET";
	Элемент.Логировать = Истина;
	Элемент.Подключение = Справочники.гкс_ПодключениеКВебСервисам.ПодключениеWarehouse;	
	#КонецОбласти

КонецПроцедуры

Процедура Описание_Units(Элементы, ПутьКSwagger)
	
	ИмяГруппыОпераций = "Units";
	
	#Область Units
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "Units";
	Элемент.Наименование = НСтр("ru = 'Единицы измерения'", 
								ОбщегоНазначения.КодОсновногоЯзыка());
	Элемент.URL = ИмяГруппыОпераций;
	Элемент.СсылкаНаДокументацию = СтрШаблон("%1#!/%2", ПутьКSwagger, ИмяГруппыОпераций);
	Элемент.Метод = "GET";
	Элемент.Логировать = Истина;
	Элемент.Подключение = Справочники.гкс_ПодключениеКВебСервисам.ПодключениеWarehouse;	
	#КонецОбласти

	#Область Units_GetById
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "Units_GetById";
	Элемент.Наименование = НСтр("ru = 'Единица измерения по идентификатору'", 
								ОбщегоНазначения.КодОсновногоЯзыка());
	Элемент.URL = "{id}";
	Элемент.СсылкаНаДокументацию = СтрШаблон("%1#!/%2/%3", 
								ПутьКSwagger, ИмяГруппыОпераций, Элемент.ИмяПредопределенныхДанных);
	Элемент.Метод = "GET";
	Элемент.Логировать = Истина;
	Элемент.Подключение = Справочники.гкс_ПодключениеКВебСервисам.ПодключениеWarehouse;	
	#КонецОбласти	

КонецПроцедуры

Процедура Описание_Stations(Элементы, ПутьКSwagger)
	
	ИмяГруппыОпераций = "Stations";
	
	#Область Stations
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "Stations";
	Элемент.Наименование = НСтр("ru = 'Станции ж.д.'", 
								ОбщегоНазначения.КодОсновногоЯзыка());
	Элемент.URL = ИмяГруппыОпераций;
	Элемент.СсылкаНаДокументацию = СтрШаблон("%1#!/%2", ПутьКSwagger, ИмяГруппыОпераций);
	Элемент.Метод = "GET";
	Элемент.Логировать = Истина;
	Элемент.Подключение = Справочники.гкс_ПодключениеКВебСервисам.ПодключениеWarehouse;	
	#КонецОбласти

	#Область Stations_GetById
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "Stations_GetById";
	Элемент.Наименование = НСтр("ru = 'Станция по идентификатору'", 
								ОбщегоНазначения.КодОсновногоЯзыка());
	Элемент.URL = "{id}";
	Элемент.СсылкаНаДокументацию = СтрШаблон("%1#!/%2/%3", 
								ПутьКSwagger, ИмяГруппыОпераций, Элемент.ИмяПредопределенныхДанных);
	Элемент.Метод = "GET";
	Элемент.Логировать = Истина;
	Элемент.Подключение = Справочники.гкс_ПодключениеКВебСервисам.ПодключениеWarehouse;	
	#КонецОбласти	

КонецПроцедуры

	
#КонецОбласти

#КонецЕсли
